
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 4 to destroy.</code></pre>

* Update
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account
* Delete
  * azurerm_media_services_account.ams
  * azurerm_media_transform.EncodeToMP
  * azurerm_media_transform.analysevideo
* Replace
  * azurerm_storage_blob.b2c_config[&#34;b2c.js&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_media_services_account.ams will be destroyed
  # (because azurerm_media_services_account.ams is not in configuration)
  - resource "azurerm_media_services_account" "ams" {
      - id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaServices/preamsstg" -> null
      - location                      = "uksouth" -> null
      - name                          = "preamsstg" -> null
      - public_network_access_enabled = true -> null
      - resource_group_name           = "pre-stg" -> null
      - storage_authentication_type   = "ManagedIdentity" -> null
      - tags                          = {
          - "application"         = "pre-recorded-evidence"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null

      - encryption {
          - type                     = "SystemKey" -> null
            # (2 unchanged attributes hidden)
        }

      - identity {
          - identity_ids = [
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pre-stg-mi",
              - "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/managed-identities-dev-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pre-dev-mi",
            ] -> null
          - type         = "UserAssigned" -> null
            # (2 unchanged attributes hidden)
        }

      - key_delivery_access_control {
          - default_action = "Allow" -> null
          - ip_allow_list  = [] -> null
        }

      - storage_account {
          - id         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg" -> null
          - is_primary = false -> null

          - managed_identity {
              - use_system_assigned_identity = false -> null
              - user_assigned_identity_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pre-stg-mi" -> null
            }
        }
      - storage_account {
          - id         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg" -> null
          - is_primary = true -> null

          - managed_identity {
              - use_system_assigned_identity = false -> null
              - user_assigned_identity_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pre-stg-mi" -> null
            }
        }
    }

  # azurerm_media_transform.EncodeToMP will be destroyed
  # (because azurerm_media_transform.EncodeToMP is not in configuration)
  - resource "azurerm_media_transform" "EncodeToMP" {
      - description                 = "Encode To MP4" -> null
      - id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaServices/preamsstg/transforms/EncodeToMP4" -> null
      - media_services_account_name = "preamsstg" -> null
      - name                        = "EncodeToMP4" -> null
      - resource_group_name         = "pre-stg" -> null

      - output {
          - on_error_action   = "ContinueJob" -> null
          - relative_priority = "Normal" -> null

          - builtin_preset {
              - preset_name = "H264SingleBitrate720p" -> null
            }
        }
    }

  # azurerm_media_transform.analysevideo will be destroyed
  # (because azurerm_media_transform.analysevideo is not in configuration)
  - resource "azurerm_media_transform" "analysevideo" {
      - description                 = "Analyse Video" -> null
      - id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaServices/preamsstg/transforms/AnalyseVideo" -> null
      - media_services_account_name = "preamsstg" -> null
      - name                        = "AnalyseVideo" -> null
      - resource_group_name         = "pre-stg" -> null

      - output {
          - on_error_action   = "ContinueJob" -> null
          - relative_priority = "Normal" -> null

          - builtin_preset {
              - preset_name = "H264SingleBitrate720p" -> null
            }
        }
    }

  # azurerm_storage_blob.b2c_config["b2c.js"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "06f35550933b363dc841ec854f74730e" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/js/b2c.js" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "js/b2c.js"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/js/b2c.js" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
        name                               = "prefinalsastg"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (97 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg"
        name                               = "preingestsastg"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (97 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":940,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->